{
  "contact": {
    "linkedIn": "https://www.linkedin.com/in/jbabdon",
    "gitHub": "https://www.github.com/CimimUxMaio",
    "email": "juanbiabdon@gmail.com"
  },

  "profile": {
    "picture": "/static/profile.jpg"
  },

  "projects": [
    {
      "title": "Bebot",
      "technologies": ["Python", "Discord.py", "Asyncio"],
      "repository": "https://www.github.com/CimimUxMaio/bebot2.0",
      "image": "/static/bebot.png",
      "about": "<b>Bebot</b> is a <b>Discord music bot</b> that started as a personal project for my friends and me. Over the years, it has evolved through feedback and new ideas, making it a <b>constant work in progress</b> that I actively improve.",
      "lessonsLearned": "Through Bebot, I’ve <b>sharpened my Python skills</b> and gained hands-on experience with <b>async programming</b> using <b>Asyncio</b>. I also learned the ins and outs of <b>Discord’s API</b> and how to interact with it using <b>discord.py</b>."
    },
    {
      "title": "Portfolio",
      "technologies": ["Go", "Gin", "TailwindCSS", "HTMX", "Templ"],
      "repository": "https://www.github.com/CimimUxMaio/portfolio",
      "image": "/static/portfolio.png",
      "about": "I built this <b>portfolio website</b> to showcase my work in a <b>clean and simple</b> way. I wanted something <b>lightweight but dynamic</b>, so I used <b>Go for the backend</b>, <b>HTMX for interactivity</b>, and <b>TailwindCSS for styling</b>.",
      "lessonsLearned": "This project was a great chance to <b>dive deeper into Go</b> and experiment with <b>HTMX for dynamic content</b>, <b>Templ for reusable HTML</b>, and <b>Gin as a web framework</b>. It reinforced my appreciation for <b>efficient, minimalistic web development</b>."
    },
    {
      "title": "CarpinchoMQ",
      "technologies": ["Elixir", "Horde", "React", "JavaScript"],
      "repository": "https://github.com/TP-IASC",
      "image": "/static/carpinchomq.jpg",
      "about": "<b>CarpinchoMQ</b> is a <b>distributed message broker</b> built in <b>Elixir</b> as part of a university project on concurrent systems. It uses <b>Horde for distributed process management</b> and includes a <b>React-based UI</b> and a simple <b>JavaScript library</b> for network interaction.",
      "lessonsLearned": "This project gave me hands-on experience with <b>Elixir’s concurrency model</b> and the challenges of <b>building distributed systems</b>. It also led me to my <b>first open-source contribution</b>, improving the desing of one of Horde's components: <a href='https://github.com/derekkraan/horde/pull/239' target='_blank' class='text-sky-300'><b>Pull Request</b></a>."
    },
    {
      "title": "GeoQuest",
      "technologies": ["ReactNative", "ViroReact", "Go", "MongoDB", "SQL", "Haskell"],
      "repository": "https://www.github.com/proyecto-final-2022",
      "image": "/static/geoquest.gif",
      "about": "<b>GeoQuest</b> is an <b>AR treasure hunt game</b> developed as a university team project. Players follow clues using their phones to bring objects to life, making it perfect for <em>museums and galleries</em> looking to enhance visitor experiences. It also included a <b>QR validation app</b> for redeeming in-game rewards.",
      "lessonsLearned": "This was my first <b>large-scale React Native project</b>, where I explored <b>AR in creative ways</b>. While we achieved our goal, I learned how crucial it is to <b>carefully choose technologies and scope</b>. We relied too much on <b>ViroReact</b>, which led to setbacks, but thanks to <b>community support</b>, we delivered a solid MVP."
    }
  ]
}
